acaballero/etherlab/lib/ST77XX-STM32/st77XX_afb.cpp
    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        setPixel(x0 + x, y0 + y, color);
        setPixel(x0 - x, y0 + y, color);
        setPixel(x0 + x, y0 - y, color);
        setPixel(x0 - x, y0 - y, color);

        setPixel(x0 + y, y0 + x, color);
        setPixel(x0 - y, y0 + x, color);
        setPixel(x0 + y, y0 - x, color);
        setPixel(x0 - y, y0 - x, color);
    }
    //Unselect();
}

void ST77XX::invertColors(uint8_t invert) {
    //select();
    writeCommand(invert ? 0x21 /* INVON */ : 0x20 /* INVOFF */);
    //Unselect();
}

void ST77XX::writeChar(char ch) {
    this->writeChar(px, py, ch, font, color, bgColor);
    this->px += font->width;
}

void ST77XX::writeChar(uint16_t x, uint16_t y, char ch, const FontDef *font, uint16_t color, uint16_t bgcolor) {

    uint16_t i, b, j;
    uint16_t px, py = y, dy, y1, y2;
    uint16_t c;

    Area *area = this->curr_area;

    y1 = this->current_line;
    y2 = this->current_line + this->chunk_height;

    if (py + font->height >= y1 && py < y2) {

        int si = max2(0, y1 - py);
        int ei = min2(font->height, y2 - py);
        int sdy = dy = max2(0, py - this->current_line);
        uint16_t mask;
        const uint8_t *data = ((FontDef8 *) font)->data;

        uint8_t incr = font->size - 1;

        if (font->encoding == ROWS) {

            mask = font->size == 2 ? 0x8000 : 0x80;
            data = data + (((ch - 32) * font->height) << incr);

            for (i = si; i < ei; i++, dy++) {

                b = font->size == 2 ? ((uint16_t *) data)[i] : ((uint8_t *) data)[i << incr];

                // Commas and periods don't look good with monospaced fonts. So we remove
                // one blank column from each side
                uint8_t j1, jn;
                if (ch == ',' || ch == '.' || ch == ':') {
                    j1 = font->trim_punct_start;
                    jn = font->width - font->trim_punct_end;
                } else {
                    j1 = 0;
                    jn = font->width;
                }

                for (j = j1, px = x; j < jn; j++, px++) {

                    if ((b << j) & mask) {
                        c = color;
                    }
                    else {
                        c = bgcolor;
                    }

                    if (c != C565_TRANSPARENT) {
                        uint16_t ix = ((dy * area->width) + px); // >> buffer->log2_pixels_per_byte;
                        *(this->curr_buffer + ix) = c;
                    }
                }
            }
        } else {

            data = data + (((ch - 32) * font->width) << incr);

            for (j = 0, px = x; j < font->width; j++, px++) {

                b = font->size == 2 ? ((uint16_t *) data)[j] : ((uint8_t *) data)[j << incr];

                for (i = si, dy = sdy; i < ei; i++, dy++) {

                    if ((b >> i) & 1) { c = color; }
                    else { c = bgcolor; }

                    if (c != C565_TRANSPARENT) {
                        uint16_t ix = ((dy * area->width) + px); // >> buffer->log2_pixels_per_byte;
                        *(this->curr_buffer + ix) = c;
                    }
                }
            }
        }
    }
}

void
ST77XX::writeString(uint16_t x, uint16_t y, const char *str, const FontDef *font, uint16_t color, uint16_t bgcolor) {
    //select();

    uint8_t delta_punct = font->width - font->trim_punct_end - font->trim_punct_start;

    while (*str) {
        if (*str == '\n' || x + font->width >= this->curr_area->width) {

            y += (font->height + (this->verticalSpacing * 2));
            x = padding_x;

            if (*str == '\n') {
                str++;
            }

            if (y + font->height >= this->curr_area->height) {
                // No more vertical space
                break;
            }

            while (*str == ' ') {
                // skip spaces at the beginning of the new line
                str++;
            }

            if (!*str) break;
        }

        writeChar(x, y, *str, font, color, bgcolor);

        uint8_t delta_x;
        if (*str == ',' || *str == '.' || *str == ':') {
            delta_x = delta_punct;
        } else {
            delta_x = font->width;
        }

        x += delta_x;
        str++;
    }
    px = x;
    py = y;
//Unselect();
}

uint16_t *ST77XX::getBuffer() {
    return this->curr_buffer;
}

void ST77XX::gotoXY(uint16_t x, uint16_t y) {
    px = x;
    py = y;
}

void ST77XX::gotoCharXY(uint16_t x, uint16_t y) {
    px = this->padding_x + (x * font->width);
    py = this->verticalSpacing + (y * (font->height + (this->verticalSpacing * 2)));
}

uint8_t ST77XX::getVerticalLineSpacing() {

    return this->verticalSpacing;
}

void ST77XX::setVerticalLineSpacing(uint8_t pixels) {
    py = (int) py - ((int) this->verticalSpacing - (int) pixels);
    this->verticalSpacing = pixels;
}

void ST77XX::setColor(uint16_t c) {
    this->color = c;
}

void ST77XX::setBgColor(uint16_t c) {
    this->bgColor = c;
}

size_t ST77XX::write(const uint8_t *buffer, size_t size) {
    writeString(px, py, (const char *) buffer, font, color, bgColor);
    return 0;
}

size_t ST77XX::write(uint8_t c) {
    writeChar(px, py, c, font, color, bgColor);
    return 0;
}

void ST77XX::setFont(const FontDef *f) {
    this->font = f;
}

const FontDef *ST77XX::getFont(void) {
    return this->font;
}

void ST77XX::test(void) {
}

size_t ST77XX::print(const char str[]) {
    return write(str);
}

size_t ST77XX::print(const char str[], const char *value, const char units[]) {

    return this->print(str, value, units, C565_GREY_LIGHT, C565_WHITE, C565_GREY_LIGHT);
}

size_t ST77XX::print(const char str[], const char *value, const char units[], uint16_t labelColor, uint16_t valueColor,
                     uint16_t unitsColor) {

    uint16_t c = this->color;
    this->setColor(labelColor);
    write(str);
    this->setColor(valueColor);
    write(value);
    this->setColor(unitsColor);
    write(units);
    this->setColor(c);

